```
 # module.slz_vpc.ibm_is_vpc.vpc[0] will be updated in-place
  ~ resource "ibm_is_vpc" "vpc" {
        id                          = "r006-30de7b2b-34c9-47af-bad7-6ca68d6948e3"
      ~ name                        = "vni-apr3-vpc-vpc" -> "vni-apr3-vpc"
        tags                        = []
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.slz_vsi.data.ibm_is_vpc.vpc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + classic_access              = (known after apply)
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_address_prefixes    = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + dns                         = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + identifier                  = "r006-30de7b2b-34c9-47af-bad7-6ca68d6948e3"
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)
    }

  # module.slz_vsi.ibm_is_virtual_network_interface.primary_vni["vni-apr3-vpc-subnet-a-0"] will be updated in-place
  ~ resource "ibm_is_virtual_network_interface" "primary_vni" {
        id                            = "0717-ac47c37d-51e5-497a-9bee-1494e9db9189"
        name                          = "vni-apr3-vpc-subnet-a-vsi-name-1-vni"
      ~ security_groups               = [
          - "r006-032db86f-fae4-4648-80a3-62878a9839c6",
        ] -> (known after apply)
        tags                          = []
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.slz_vsi.ibm_is_virtual_network_interface.primary_vni["vni-apr3-vpc-subnet-b-0"] will be updated in-place
  ~ resource "ibm_is_virtual_network_interface" "primary_vni" {
        id                            = "0727-c25eab13-9e76-42f6-b3a6-0fec12cb6705"
        name                          = "vni-apr3-vpc-subnet-b-vsi-name-1-vni"
      ~ security_groups               = [
          - "r006-032db86f-fae4-4648-80a3-62878a9839c6",
        ] -> (known after apply)
        tags                          = []
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.slz_vsi.ibm_is_virtual_network_interface.primary_vni["vni-apr3-vpc-subnet-c-0"] will be updated in-place
  ~ resource "ibm_is_virtual_network_interface" "primary_vni" {
        id                            = "0737-4a0aa055-abfe-4588-80ba-2207b45c23a1"
        name                          = "vni-apr3-vpc-subnet-c-vsi-name-1-vni"
      ~ security_groups               = [
          - "r006-032db86f-fae4-4648-80a3-62878a9839c6",
        ] -> (known after apply)
        tags                          = []
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.slz_vsi.ibm_is_virtual_network_interface.secondary_vni["vni-apr3-second-subnet-a-0"] will be updated in-place
  ~ resource "ibm_is_virtual_network_interface" "secondary_vni" {
        id                            = "0717-9c12aead-30d2-409c-a8cb-5386397535cb"
        name                          = "vni-apr3-second-subnet-a-0"
      ~ security_groups               = [
          - "r006-032db86f-fae4-4648-80a3-62878a9839c6",
        ] -> (known after apply)
        tags                          = []
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.slz_vsi.ibm_is_virtual_network_interface.secondary_vni["vni-apr3-second-subnet-b-0"] will be updated in-place
  ~ resource "ibm_is_virtual_network_interface" "secondary_vni" {
        id                            = "0727-6cd21988-1c8b-4092-8027-a66c78a7bf0a"
        name                          = "vni-apr3-second-subnet-b-0"
      ~ security_groups               = [
          - "r006-032db86f-fae4-4648-80a3-62878a9839c6",
        ] -> (known after apply)
        tags                          = []
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.slz_vsi.ibm_is_virtual_network_interface.secondary_vni["vni-apr3-second-subnet-c-0"] will be updated in-place
  ~ resource "ibm_is_virtual_network_interface" "secondary_vni" {
        id                            = "0737-a0d7d269-d2db-4dcf-8837-a8c845f42fef"
        name                          = "vni-apr3-second-subnet-c-0"
      ~ security_groups               = [
          - "r006-032db86f-fae4-4648-80a3-62878a9839c6",
        ] -> (known after apply)
        tags                          = []
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  ~ slz_vpc                   = {
      + security_group_details       = {}
      ~ vpc_data                     = {
            id                          = "r006-30de7b2b-34c9-47af-bad7-6ca68d6948e3"
            name                        = "vni-apr3-vpc-vpc"
          ~ subnets                     = [
              ~ {
                  ~ available_ipv4_address_count = 251 -> 248
                    id                           = "0727-7eb9f299-6c18-4cd8-8377-f877b49bff90"
                    name                         = "vni-apr3-vpc-subnet-b"
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ available_ipv4_address_count = 251 -> 247
                    id                           = "0737-01eb071e-1e2c-4106-850b-87a873f8df9d"
                    name                         = "vni-apr3-vpc-subnet-c"
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ available_ipv4_address_count = 251 -> 245
                    id                           = "0717-3ef9aac4-49ee-458e-9da8-294615cb260c"
                    name                         = "vni-apr3-vpc-subnet-a"
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ available_ipv4_address_count = 251 -> 250
                    id                           = "0717-83435602-4f67-44a5-954f-d1c4c1a6e1fb"
                    name                         = "vni-apr3-second-subnet-a"
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ available_ipv4_address_count = 251 -> 250
                    id                           = "0727-09cae020-91e0-4aa9-b800-3bdbe6baf1e9"
                    name                         = "vni-apr3-second-subnet-b"
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ available_ipv4_address_count = 251 -> 250
                    id                           = "0737-4ae10193-0e1f-4c5c-8176-352ab89bbd0d"
                    name                         = "vni-apr3-second-subnet-c"
                    # (3 unchanged attributes hidden)
                },
            ]
            tags                        = []
            # (25 unchanged attributes hidden)
        }
      ~ vpc_name                     = "vni-apr3-vpc-vpc" -> "vni-apr3-vpc"
      + vpn_gateways_data            = []
      + vpn_gateways_name            = []
        # (19 unchanged attributes hidden)
    }

```

Changes are just update-in-place, no breaking change. The only change here is the renaming of the vpc.
skipping the upgrade test